# Index objects and labeled data

In [1]:
 import pandas as pd

In [5]:
sales = pd.read_csv('sales.csv')

In [9]:
sales = sales.set_index(['eggs','month'])

In [10]:
sales

            salt  spam
eggs month
47   Jan    12.0    17
110  Feb    50.0    31
221  Mar    89.0    72
77   Apr    87.0    20
132  May     NaN    52
205  Jun    60.0    55

In [13]:
sales.sort_index()

            salt  spam
eggs month
47   Jan    12.0    17
77   Apr    87.0    20
110  Feb    50.0    31
132  May     NaN    52
205  Jun    60.0    55
221  Mar    89.0    72

# Pivoting

In [15]:
users = pd.read_csv('users.csv')

In [17]:
del users[users.columns[0]]

In [18]:
users

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

In [24]:
uber_pivot = users.pivot(index = 'weekday',columns = 'city', values= 'visitors')

In [25]:
uber_pivot

city     Austin  Dallas
weekday
Mon         326     456
Sun         139     237

In [26]:
# Pivot users with signups indexed by weekday and city: signups_pivot
signups_pivot = users.pivot(index = 'weekday', columns = 'city', values = 'signups')

# Print signups_pivot
print(signups_pivot)

# Pivot users pivoted by both signups and visitors: pivot
pivot = users.pivot(index = 'weekday',columns = 'city')

# Print the pivoted DataFrame
print(pivot)

city     Austin  Dallas
weekday
Mon           3       5
Sun           7      12
        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12

 # Stacking & unstacking DataFrames

In [32]:
users = pd.read_csv('users.csv')
del users[users.columns[0]]

In [33]:
users = users.set_index(['city','weekday'])

In [35]:
users = users.sort_index()

                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

In [38]:
#nstack users by 'weekday': byweekday
byweekday = users.unstack(level = 'weekday')

# Print the byweekday DataFrame
print(byweekday)

# Stack byweekday by 'weekday' and print it
print(byweekday.stack(level = 'weekday'))
# Unstack users by 'city': bycity
bycity = users.unstack(level = 'city')

# Print the bycity DataFrame
print(bycity)

# Stack bycity by 'city' and print it
print(bycity.stack(level ='city'))

        visitors      signups
weekday      Mon  Sun     Mon Sun
city
Austin       326  139       3   7
Dallas       456  237       5  12
                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12
        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12
                visitors  signups
weekday city
Mon     Austin       326        3
        Dallas       456        5
Sun     Austin       139        7
        Dallas       237       12

In [39]:


# Stack 'city' back into the index of bycity: newusers
newusers =  bycity.stack(level ='city')
# Swap the levels of the index of newusers: newusers
newusers = newusers.swaplevel(0,1)
# Print newusers and verify that the index is not sorted
print(newusers)

# Sort the index of newusers: newusers
newusers = newusers.sort_index()

# Print newusers and verify that the index is now sorted
print(newusers)

                visitors  signups
city   weekday
Austin Mon           326        3
Dallas Mon           456        5
Austin Sun           139        7
Dallas Sun           237       12
                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

# Melting DataFrames

# Categoricals and grouby